In [12]:
import pandas as pd
import geopandas as gpd
import os
from shapely.geometry import Point
from lxml import etree
import h3

In [29]:
df = pd.read_csv("..\Datasets\existing_stations.csv", usecols=['lat','lon','name'])
df

           lat       lon                                   name
0    51.529163 -0.109970             River Street , Clerkenwell
1    51.499606 -0.197574         Phillimore Gardens, Kensington
2    51.521283 -0.084605   Christopher Street, Liverpool Street
3    51.530059 -0.120973        St. Chad's Street, King's Cross
4    51.493130 -0.156876          Sedding Street, Sloane Square
..         ...       ...                                    ...
793  51.461923 -0.165297         Limburg Road, Clapham Junction
794  51.532091 -0.061419        Pritchard's Road, Bethnal Green
795  51.486343 -0.122492  Kennington Lane Rail Bridge, Vauxhall
796  51.490435 -0.122806            Albert Embankment, Vauxhall
797  51.500139 -0.113935                  Lower Marsh, Waterloo

[798 rows x 3 columns]

In [ ]:
df['h3_id'] = [h3.latlng_to_cell(lat, lon, 9) for lat, lon in zip(df['lat'], df['lon'])]
df1 = df['h3_id'].unique()

In [28]:
output = df.groupby('h3_id').agg({
    'name': 'count',
    'lat': 'mean',
    'lon': 'mean'
}).rename(columns={'name': 'station_count'}).reset_index()

output.to_csv('..\Datasets\h3_stations.csv', index=False)